//
//  MockData.swift
//  Mentoro
//
//  Created by MacBookAir on 4/20/25.
//

let mockMentors: [Mentor] = [
    Mentor(
        name: .Lingo,
        imageName: "lingo",
        field: .개발,
        interests: [.자료구조, .추상화, .객체지향, .아키텍처, .코드가독성, .IOS, .OS이해, .프론트엔드, .ML, .API, .인프라, .프로토타이핑, .UI디자인, .컬러시스템, .HIG, .Sketch, .디자인리서치, .디자인방법론, .MVP전략, .마케팅, .창업, .스타트업운영, .사업자등록, .세무관리, .법인설립, .프리랜서운영, .세금관리, .팀운영, .업무자동화, .앱수익화전략, .오너쉽, .메타인지, .습관형성, .평생학습, .디지털노마드, .학습과학, .시간관리, .문제정의, .인사이트도출, .비판적사고, .논리적사고, .의사결정, .팀워크, .팀커뮤니케이션, .클라이언트커뮤니케이션, .스피치, .프레젠테이션, .성장마인드셋, .긍정성, .수용성, .자기동기부여, .겸손과존중, .구스구스덕, .보드게임, .방탈출, .러닝, .등산, .수영, .자전거, .클라이밍, .프리다이빙, .요트세일링, .서핑, .UFC, .격투기, .햄버거, .라면, .회, .초밥, .만두, .국밥, .빵, .와인, .위스키, .고량주, .맛집탐방, .요리, .자취요리, .락, .Kpop, .힙합, .건강, .캠핑, .교육, .책, .강의, .영화, .사진, .유튜브],
        features: [.개발, .아이디어, .애플]
        
    ),
    Mentor(
        name: .Gommin,
        imageName: "gommin",
        field: .비즈니스,
        interests: [.IOS, .VisionOS, .UnityUnreal, .게임개발, .데이터엔지니어링, .데이터시각화, .UX설계, .프로토타이핑, .디자인리서치, .레퍼런스수집, .게임내러티브디자인, .PM, .비즈니스전략, .MVP전략, .스토리텔링, .마케팅, .스타트업운영, .팀운영, .업무자동화, .앱수익화전략, .오너쉽, .평생학습, .시간관리, .인사이트도출, .비판적사고, .논리적사고, .의사결정, .팀커뮤니케이션, .성장마인드셋, .자기동기부여, .LOL, .TFT, .WOW, .구스구스덕, .스위치, .스팀게임, .인디게임, .보드게임, .방탈출, .젤다의전설, .야구, .치킨, .돈까스, .만두, .위스키, .맛집탐방, .요리, .레시피연구, .Kpop, .힙합, .육아, .결혼, .자기계발, .건강, .다이어트, .교육, .영화, .드라마, .웹툰],
        features: [.비즈니스, .스마일, .다크써클]
        
    ),
    Mentor(
        name: .Lumi,
        imageName: "lumi",
        field: .개발,
        interests: [.자료구조, .추상화, .객체지향, .아키텍처, .코드가독성, .유지보수, .테스트코드, .테스트자동화, .리팩토링, .지속가능개발, .IOS, .Web, .OS이해, .프론트엔드, .인프라, .UX설계, .MVP전략, .브랜딩, .마케팅, .창업, .스타트업운영, .사업자등록, .법인설립, .투자유치, .프리랜서운영, .포트폴리오제작, .팀운영, .업무자동화, .마음관리, .오너쉽, .습관형성, .평생학습, .인사이트도출, .논리적사고, .의사결정, .팀워크, .성장마인드셋, .LOL, .오버워치, .축구, .풋살, .야구, .농구, .등산, .헬스, .치킨, .피자, .떡볶이, .마라탕, .햄버거, .라면, .돈까스, .회, .초밥, .만두, .국밥, .국수, .빵, .과자, .아이스크림, .디저트, .커피, .차, .맥주, .소주, .위스키, .보드카, .맛집탐방, .요리, .자취요리, .레시피연구, .노포맛집, .팝, .락, .힙합, .재즈, .보컬, .다이어트, .강아지, .고양이, .자연, .드라마, .웹툰],
        features: [.개발, .스마일, .야구]
    ),
    Mentor(
        name: .Nathan,
        imageName: "nathan",
        field: .개발,
        interests: [.자료구조, .추상화, .객체지향, .아키텍처, .코드가독성, .유지보수, .리팩토링, .지속가능개발, .IOS, .게임개발, .프론트엔드, .팀운영, .마음관리, .오너쉽, .메타인지, .습관형성, .평생학습, .학습과학, .시간관리, .문제정의, .논리적사고, .의사결정, .창의성, .팀워크, .팀커뮤니케이션, .스피치, .프레젠테이션, .성장마인드셋, .긍정성, .수용성, .자기동기부여, .겸손과존중, .FC24, .축구, .치킨, .피자, .떡볶이, .햄버거, .라면, .돈까스, .회, .초밥, .만두, .국밥, .국수, .빵, .커피, .차, .자취요리, .락, .Kpop, .여돌, .남돌, .재즈, .인디음악, .발라드, .기타, .육아, .연애, .결혼, .자기계발, .교육, .책, .강의, .예능, .유튜브, .인스타그램, .페이스북, .링크드인, .트위터],
        features: [.개발, .지원, .축구]
    ),
    Mentor(
        name: .MK,
        imageName: "mk",
        field: .러닝디벨롭먼트,
        interests: [.UX설계, .스토리텔링, .팀운영, .마음관리, .오너쉽, .메타인지, .습관형성, .평생학습, .학습과학, .시간관리, .문제정의, .인사이트도출, .비판적사고, .논리적사고, .의사결정, .창의성, .팀워크, .팀커뮤니케이션, .스피치, .프레젠테이션, .성장마인드셋, .긍정성, .수용성, .자기동기부여, .겸손과존중, .보드게임, .방탈출, .레이저서바이벌, .러닝, .등산, .요가, .떡볶이, .마라탕, .라면, .과자, .커피, .와인, .위스키, .채식비건, .자기계발, .평생학습, .건강, .강아지, .자연, .하늘구름, .캠핑, .교육, .책, .강의, .영화, .드라마],
        features: [.러닝디벨롭, .칭찬, .러닝]
    ),
    Mentor(
        name: .Howard,
        imageName: "howard",
        field: .개발,
        interests: [.코드가독성, .유지보수, .지속가능개발, .IOS, .프론트엔드, .마음관리, .오너쉽, .디지털노마드, .문제정의, .비판적사고, .논리적사고, .의사결정, .팀커뮤니케이션, .성장마인드셋, .LOL, .헬스, .요가, .프리다이빙, .치킨, .햄버거, .국수, .빵, .아이스크림, .떡, .디저트, .커피, .맛집탐방, .키토음식, .재즈, .인디음악, .발라드, .결혼, .자기계발, .건강, .강아지, .자연, .하늘구름, .캠핑, .유튜브, .인스타그램, .페이스북, .링크드인],
        features: [.개발, .장난, .크록스]
    ),
    Mentor(
        name: .Sup,
        imageName: "sup",
        field: .디자인,
        interests: [.UX설계, .프로토타이핑, .UI디자인, .Figma, .디자인리서치, .디자인방법론, .레퍼런스수집, .서비스기획, .비즈니스전략, .MVP전략, .브랜딩, .스토리텔링, .마케팅, .창업, .투자유치, .앱수익화전략, .오너쉽, .메타인지, .평생학습, .학습과학, .문제정의, .인사이트도출, .분석적추론, .사고방식프레임워크, .비판적사고, .논리적사고, .의사결정, .창의성, .팀커뮤니케이션, .클라이언트커뮤니케이션, .스피치, .프레젠테이션, .자기동기부여, .LOL, .TFT, .오버워치, .구스구스덕, .어몽어스, .마피아게임, .스위치, .보드게임, .러닝, .헬스, .탁구, .치킨, .햄버거, .돈까스, .회, .초밥, .만두, .국밥, .빵, .커피, .차, .맛집탐방,.미식회, .맛난음식나누기, .요리, .레시피연구, .푸드페어, .푸드테크, .저탄고지, .팝, .락, .힙합, .인디음악, .보컬, .드럼, .육아, .연애, .결혼, .평생학습, .건강, .고양이, .자연, .교육, .책, .영화, .웹툰, .드로잉],
        features: [.비즈디자인, .팩트, .치킨]
    ),
    Mentor(
        name: .Daisy,
        imageName: "daisy",
        field: .디자인,
        interests: [.UI디자인, .컬러시스템, .타이포그래피, .아이콘디자인, .Adobe, .Figma, .Blender, .입체모델링, .모션그래픽, .레퍼런스수집, .브랜딩, .스토리텔링, .마케팅, .포트폴리오제작, .창의성, .팀워크, .팀커뮤니케이션, .프레젠테이션, .구스구스덕, .스위치, .스팀게임, .보드게임, .방탈출, .젤다의전설, .마인크래프트, .러닝, .필라테스, .클라이밍, .테니스, .스쿠버다이빙, .떡볶이, .마라탕, .햄버거, .라면, .초밥, .빵, .과자, .아이스크림, .떡, .디저트, .커피, .차, .와인, .맛집탐방, .요리, .노포맛집, .Kpop, .힙합, .EDM, .재즈, .기타, .강아지, .자연, .하늘구름, .캠핑, .강의, .영화, .드라마, .예능, .웹툰, .브이로그, .일기, .숏폼, .유튜브],
        features: [.디자인, .스마일, .구름]
    ),
]
